import { CredType } from "const";

export const common = {
  back: "Назад",
  cancel: "Адмена",
  no: "Не",
  yes: "Так",
  ok: "Так",
  allow: "Дазволіць",
  reject: "Адмовіць",
  error: "Памылка",
  errorText: "Нешта пайшло не так...\nПеразапусціце апку калі ласка",
  copy: "Скапіяваць",
  other: "Іншы",
  save: "Захаваць",
  skip: "Прапусціць",
  enable: "Уключыць",
  start: "Пачаць",
  continue: "Працягнуць",
  confirm: "Пацвярджаю",
  check: "Праверыць",
  remove: "Выдаліць",

  issuing: "Афармленне дакумента...",

  kycExpiredTitle: "Спроба верыфікацыі састарэла",
  kycExpiredText: "Жадаеце паспрабаваць прайсці верыфікацыю яшчэ раз?",
  kycResubmitTitle: "Памылка праверкі дадзеных",
  kycResubmitText:
    "{{reason}}\n\nВам неабходна прадставіць няправільна распазнаныя дадзеныя. Жадаеце зрабіць гэта зараз?",
  kycDeclinedTitle: "Ваша верыфікацыя была адхілена",
  kycDeclinedText:
    "{{reason}}\n\nМагчыма, гэта нейкая памылка. А, магчыма, вы робіце нешта нядобрае. У любым выпадку мы дазволім вам прайсці верыфікацыю яшчэ раз. Жадаеце зрабіць гэта зараз?",
  issuerAlreadyIssuedForDid: "Лічбавы ID ужо быў выпушчаны для вас",
  issuerAlreadyIssuedForPersonId:
    "Лічбавы ID ужо быў выпушчаны для вашага асабістага нумара",

  boundMinMax: "ад {{min}} да {{max}}",
  boundMin: "ад {{min}}",
  boundMax: "да {{max}}",

  credName: {
    [CredType.passport]: "Лічбавы ID",
    [CredType.telegram]: "Тэлеграм",
  },

  knownCredValues: {
    [CredType.passport]: "Лічбавы ID",
    "5DCFQWcdMiX2yfHCMkh1J1ENH6H8ziZ1Ms1NZdWsKFmsRRTd": "Belarus ID",
  },

  gender: {
    male: "Мужчынскі",
    female: "Жаночы",
  },

  credField: {
    id: "ID дакумента",
    type: "Тып дакумента",
    issuer: "Эмітэнт дакумента",
    holder: "Ваш ID",
    docId: "Нумар дакумента",
    issuedAt: "Выдадзены",
    validUntil: "Годны да",
    personId: "Асабісты нумар",
    firstName: "Імя",
    lastName: "Прозвішча",
    gender: "Гендэр",
    placeOfBirth: "Месца нараджэння",
    dateOfBirth: "Дата нараджэння",
    nationality: "Нацыянальнасць",
    country: "Краіна",
    authority: "Кім выдадзены",
    photo: "Фота",
  },

  credFieldTg: {
    id: "Telegram ID",
    hasGolos: "Удзельнік «Голасу»",
  },
};

export const navBar = {
  votings: "Галасавання",
  creds: "Дакументы",
  settings: "Налады",
};

export const deniedCountry = {
  ask: "Мы клапоцімся пра вас!\n\nКалі ласка, калі вы не знаходзіцеся ў бяспечнай краіне, скарыстайцеся адным з VPN-сэрвісаў",
  instruction: "інструкцыя",
  confirm: "Я ў бяспечнай краіне ці з VPN",
  noCountry: "У нас не атрымалася праверыць вашу краіну 😔",
  noCountryWarning:
    "Дзеля вашай бяспекі, мы не можам запусціць апку. Паспрабуйце яшчэ раз калі ласка.",
  country: "Здаецца, вы знаходзіцеся ў {{country}}",
  warning:
    "Калі вы, на свой страх і рызыку, жадаеце выкарыстоўваць апку з гэтай краіны, калі ласка скарыстайцеся VPN.",
};

export const pinSet = {
  title: "Прыдумайце пін-код",
  subtitle: "для ўваходу ў апку",
  repeatTitle: "Паўтарыце пін-код",
  repeatSubtitle: "",
  notMatchTitle: "Пін-коды не супадаюць",
  notMatchSubtitle: "Паспрабуйце яшчэ раз",
};

export const pinAsk = {
  title: "Увядзіце пін-код",
  blockedPinTitle: "Заблакавана",
  blockedPinSubtitle: "Пачакайце {{left}} да наступнай спробы",
  wrongPinTitle: "Няверны пін-код",
  wrongPinSubtitle: "Паспрабуйце яшчэ раз",
};

export const unlock = {
  pinAskReason: "для ўваходу ў апку",
};

export const credIssue = {
  title: "Новы Лічбавы ID",
  howWorksWebTitle: "Як гэта працуе?",
  info2:
    "Ніхто (уключаючы нас!) не будзе мець да яго доступу без вашага дазволу",

  pin: {
    title: "Усталяванне пін-коду",
    desc: "Каб дадаткова абараніць вашыя дадзеныя ў выпадку страты смартфона, калі ласка, усталюйце пін-код на ўваход у апку.",
    action: "Усталяваць",
  },

  key: {
    title: "Стварэнне ключа",
    desc: "На гэтым кроку вы створыце для сябе ўнікальны ключ доступу. Гэта ваш лічбавы профіль Беларуса. Калі ласка, захавайце яго ў бяспечным месцы. І нікому ніколі яго не паказвайце. Гэта важна!\n\nНі мы, ні хто-небудзь іншы, ні пры якіх абставінах не будзем яго запытваць. Яго павінны знаць толькі вы!",
    action: "Стварыць",
  },

  verify: {
    title: "Верыфікацыя дадзеных",
    action: "Верыфікаваць",
    see: "Атрымаць!",
  },

  cm: {
    title: "Апавяшчэнні",
    desc: "Нам бы хацелася апавяшчаць вас аб новых галасаваннях і важных абнаўленнях. Мы будзем рабіць гэта рэдка і ненадакучліва, абяцаем!",
  },
};

export const keyCreating = {
  title: "Стварэнне ключа",
  desc: `Праз некалькі секунд вы створыце для сябе ўнікальны ключ доступу.
  
Вы зможаце выкарыстоўваць яго:
- для выпуску лічбавых дакументаў
- для электроннага подпісу
- каб працаваць з нашымі сэрвісамі

Калі ласка, захавайце яго ў бяспечным месцы. Лепш за ўсё, калі гэта будзе дзесьці ў афлайне.`,
  noRecovery:
    "Мы не ведаем гэтага ключа. І ў выпадку страты не зможам вам яго аднавіць.",
  agreeSaved:
    "* Я захаваў свой ключ у бяспечным месцы і разумею, што мне не змогуць яго аднавіць",
  noDisclose:
    "Вельмі важна запомніць адно простае правіла: ніколі, нікому, ні пры якіх абставінах яго не паказвайце. Калі ў вас яго пытаюцца - вас спрабуюць падмануць.",
  agreeNoDisclose:
    "* Я ніколі, нікому, ні пры якіх абставінах не буду раскрываць свой ключ",
  addKey: "Усталяваць",
  errorCreating: "Памылка стварэння ключа",
};

export const credExport = {
  title: "Стварэнне рэзервовай копіі",
  desc: "",
  errorExporting: "Памылка стварэння рэзервовай копіі",
};

export const credList = {
  title: "Дакументы",
  issue: "Аформіць",
};

export const votingList = {
  title: "Галасавання",
  noVotings: "Няма галасаванняў",
  startAt: "Пачатак",
  endAt: "Cкончыцца",
  endedAt: "Cкончылася",
};

export const voting = {
  title: "Галасаванне {{code}}",
  askIssueTitle: "Аформіць Лічбавы ID?",
  askIssueText: "У вас яшчэ няма Лічбавага ID. Жадаеце аформіць?",
  askIssueYes: "Аформіць",
};

export const web = {
  defaultTitle: "Вэб-старонка",
};

export const settings = {
  title: "Налады",
  appName: "Belarus ID",
  appVersion: "Версія",
  did: "Ваш ID:",
  analytics: {
    title: "Аналітыка",
    analytics: "Абязлічаная аналітыка",
    crashReport: "Паведамлення аб памылках",
  },
  creds: {
    title: "Дакументы",
    export: "Зрабіць рэзервовую копію",
  },
  security: {
    title: "Бяспека",
    pinSet: "Усталяваць пін-код",
    pinChange: "Змяніць пін-код",
    pinAskReason: "які ўсталяваны зараз",
    removeAllData: "Выдаліць усе дадзеныя",
    removeAllDataConfirmTitle: "Выдаліць усе дадзеныя?",
    removeAllDataConfirmText:
      "На дадзены момант мы не сінхранізуем ніякія дадзеныя, і пакуль не дадалі магчымасць іх экспарту. Але, калі вы захавалі свой лічбавы ключ, то зможаце перавыпусціць дакументы потым.",
    removeAllDataFailed:
      "Мы не змаглі выдаліць нейкія дадзеныя апкі. Хутчэй за ўсё, у гэтым няма нічога страшнага.\n\nКалі ў вас Android, то выдаленне прыкладання цалкам ачысціць усе дадзеныя.\n\nУ выпадку iOS атрымаць доступ да дадзеных усё роўна будзе немагчыма. Паспрабуйце выдаліць апку і паставіць яе нанова, каб пераканацца, што апка не адлюстроўвае іх.",
    removeAllDataOkTitle: "Поспех!",
    removeAllDataOkText: "Усе дадзеныя апки былі паспяхова выдалены",
  },
  contact: {
    title: "Сувязь",
    email: "Напісаць нам",
    noEmailClientTitle: "Не знойдзены email-кліент",
    noEmailClientText:
      "Калі ласка дашліце нам ліст на адрас электроннай пошты\n{{contactEmail}}",
  },
};

export const presentationAsk = {
  title: "Дазволіць доступ да дадзеных?",
  service: "Сэрвіс",
  ask: "запытвае вашыя персанальныя дадзеныя:",
};

export const qrTgIssue = {
  noCamera: "Камера недаступная :(",
};
